tiborsimon/embedded-tdd-headers/pic/pic18/pic18f86j15_tdd.h
#define LB                            522
#define PORTJ_RJ6                     523
#define PORTJ_RJ7                     524
#define UB                            525
#define LATA                          526
#define LATA0                         527
#define LA0                           528
#define LATA1                         529
#define LA1                           530
#define LATA2                         531
#define LA2                           532
#define LATA3                         533
#define LA3                           534
#define LATA4                         535
#define LA4                           536
#define LATA5                         537
#define LA5                           538
#define LATB                          539
#define LB0                           540
#define LATB0                         541
#define LB1                           542
#define LATB1                         543
#define LB2                           544
#define LATB2                         545
#define LB3                           546
#define LATB3                         547
#define LB4                           548
#define LATB4                         549
#define LB5                           550
#define LATB5                         551
#define LB6                           552
#define LATB6                         553
#define LB7                           554
#define LATB7                         555
#define LATC                          556
#define LATC0                         557
#define LC0                           558
#define LATC1                         559
#define LC1                           560
#define LATC2                         561
#define LC2                           562
#define LATC3                         563
#define LC3                           564
#define LATC4                         565
#define LC4                           566
#define LATC5                         567
#define LC5                           568
#define LATC6                         569
#define LC6                           570
#define LATC7                         571
#define LC7                           572
#define LATD                          573
#define LATD0                         574
#define LD0                           575
#define LATD1                         576
#define LD1                           577
#define LATD2                         578
#define LD2                           579
#define LATD3                         580
#define LD3                           581
#define LATD4                         582
#define LD4                           583
#define LATD5                         584
#define LD5                           585
#define LATD6                         586
#define LD6                           587
#define LATD7                         588
#define LD7                           589
#define LATE                          590
#define LATE0                         591
#define LE0                           592
#define LATE1                         593
#define LE1                           594
#define LATE2                         595
#define LE2                           596
#define LATE3                         597
#define LE3                           598
#define LATE4                         599
#define LE4                           600
#define LATE5                         601
#define LE5                           602
#define LATE6                         603
#define LE6                           604
#define LATE7                         605
#define LE7                           606
#define LATF                          607
#define LATF1                         608
#define LF1                           609
#define LF2                           610
#define LATF2                         611
#define LF3                           612
#define LATF3                         613
#define LF4                           614
#define LATF4                         615
#define LF5                           616
#define LATF5                         617
#define LF6                           618
#define LATF6                         619
#define LF7                           620
#define LATF7                         621
#define LATG                          622
#define LATG0                         623
#define LG0                           624
#define LATG1                         625
#define LG1                           626
#define LATG2                         627
#define LG2                           628
#define LATG3                         629
#define LG3                           630
#define LATG4                         631
#define LG4                           632
#define LATH                          633
#define LH0                           634
#define LATH0                         635
#define LH1                           636
#define LATH1                         637
#define LH2                           638
#define LATH2                         639
#define LH3                           640
#define LATH3                         641
#define LH4                           642
#define LATH4                         643
#define LH5                           644
#define LATH5                         645
#define LH6                           646
#define LATH6                         647
#define LH7                           648
#define LATH7                         649
#define LATJ                          650
#define LATJ0                         651
#define LJ0                           652
#define LATJ1                         653
#define LJ1                           654
#define LATJ2                         655
#define LJ2                           656
#define LATJ3                         657
#define LJ3                           658
#define LATJ4                         659
#define LJ4                           660
#define LATJ5                         661
#define LJ5                           662
#define LATJ6                         663
#define LJ6                           664
#define LATJ7                         665
#define LJ7                           666
#define TRISA                         667
#define TRISA_RA0                     668
#define TRISA0                        669
#define TRISA_RA1                     670
#define TRISA1                        671
#define TRISA2                        672
#define TRISA_RA2                     673
#define TRISA_RA3                     674
#define TRISA3                        675
#define TRISA_RA4                     676
#define TRISA4                        677
#define TRISA_RA5                     678
#define TRISA5                        679
#define TRISB                         680
#define TRISB_RB0                     681
#define TRISB0                        682
#define TRISB_RB1                     683
#define TRISB1                        684
#define TRISB_RB2                     685
#define TRISB2                        686
#define TRISB_RB3                     687
#define TRISB3                        688
#define TRISB_RB4                     689
#define TRISB4                        690
#define TRISB_RB5                     691
#define TRISB5                        692
#define TRISB_RB6                     693
#define TRISB6                        694
#define TRISB_RB7                     695
#define TRISB7                        696
#define TRISC                         697
#define TRISC0                        698
#define TRISC_RC0                     699
#define TRISC1                        700
#define TRISC_RC1                     701
#define TRISC2                        702
#define TRISC_RC2                     703
#define TRISC3                        704
#define TRISC_RC3                     705
#define TRISC4                        706
#define TRISC_RC4                     707
#define TRISC5                        708
#define TRISC_RC5                     709
#define TRISC6                        710
#define TRISC_RC6                     711
#define TRISC7                        712
#define TRISC_RC7                     713
#define TRISD                         714
#define TRISD_RD0                     715
#define TRISD0                        716
#define TRISD_RD1                     717
#define TRISD1                        718
#define TRISD_RD2                     719
#define TRISD2                        720
#define TRISD_RD3                     721
#define TRISD3                        722
#define TRISD_RD4                     723
#define TRISD4                        724
#define TRISD_RD5                     725
#define TRISD5                        726
#define TRISD_RD6                     727
#define TRISD6                        728
#define TRISD_RD7                     729
#define TRISD7                        730
#define TRISE                         731
#define TRISE_RE0                     732
#define TRISE0                        733
#define TRISE1                        734
#define TRISE_RE1                     735
#define TRISE2                        736
#define TRISE_RE2                     737
#define TRISE_RE3                     738
#define TRISE3                        739
#define TRISE_RE4                     740
#define TRISE4                        741
#define TRISE_RE5                     742
#define TRISE5                        743
#define TRISE_RE6                     744
#define TRISE6                        745
#define TRISE_RE7                     746
#define TRISE7                        747
#define TRISF                         748
#define TRISF_RF1                     749
#define TRISF1                        750
#define TRISF2                        751
#define TRISF_RF2                     752
#define TRISF_RF3                     753
#define TRISF3                        754
#define TRISF_RF4                     755
#define TRISF4                        756
#define TRISF_RF5                     757
#define TRISF5                        758
#define TRISF_RF6                     759
#define TRISF6                        760
#define TRISF7                        761
#define TRISF_RF7                     762
#define TRISG                         763
#define TRISG0                        764
#define TRISG_RG0                     765
#define TRISG1                        766
#define TRISG_RG1                     767
#define TRISG2                        768
#define TRISG_RG2                     769
#define TRISG_RG3                     770
#define TRISG3                        771
#define TRISG4                        772
#define TRISG_RG4                     773
#define TRISH                         774
#define TRISH_RH0                     775
#define TRISH0                        776
#define TRISH_RH1                     777
#define TRISH1                        778
#define TRISH_RH2                     779
#define TRISH2                        780
#define TRISH_RH3                     781
#define TRISH3                        782
#define TRISH_RH4                     783
#define TRISH4                        784
#define TRISH_RH5                     785
#define TRISH5                        786
#define TRISH_RH6                     787
#define TRISH6                        788
#define TRISH_RH7                     789
#define TRISH7                        790
#define TRISJ                         791
#define TRISJ_RJ0                     792
#define TRISJ0                        793
#define TRISJ_RJ1                     794
#define TRISJ1                        795
#define TRISJ_RJ2                     796
#define TRISJ2                        797
#define TRISJ_RJ3                     798
#define TRISJ3                        799
#define TRISJ_RJ4                     800
#define TRISJ4                        801
#define TRISJ_RJ5                     802
#define TRISJ5                        803
#define TRISJ_RJ6                     804
#define TRISJ6                        805
#define TRISJ_RJ7                     806
#define TRISJ7                        807
#define OSCTUNE                       808
#define PLLEN                         809
#define MEMCON                        810
#define WM                            811
#define WM0                           812
#define WM1                           813
#define WAIT0                         814
#define WAIT                          815
#define WAIT1                         816
#define EBDIS                         817
#define PIE1                          818
#define TMR1IE                        819
#define TMR2IE                        820
#define CCP1IE                        821
#define CCPIE                         822
#define SSPIE                         823
#define SSP1IE                        824
#define TXIE                          825
#define TX1IE                         826
#define RC1IE                         827
#define RCIE                          828
#define ADIE                          829
#define PSPIE                         830
#define PIR1                          831
#define TMR1IF                        832
#define TMR2IF                        833
#define CCP1IF                        834
#define CCPIF                         835
#define SSPIF                         836
#define SSP1IF                        837
#define TXIF                          838
#define TX1IF                         839
#define RCIF                          840
#define RC1IF                         841
#define ADIF                          842
#define PSPIF                         843
#define IPR1                          844
#define TMR1IP                        845
#define TMR2IP                        846
#define CCPIP                         847
#define CCP1IP                        848
#define SSPIP                         849
#define SSP1IP                        850
#define TX1IP                         851
#define TXIP                          852
#define RCIP                          853
#define RC1IP                         854
#define ADIP                          855
#define PSPIP                         856
#define PIE2                          857
#define CCP2IE                        858
#define TMR3IE                        859
#define BCL1IE                        860
#define BCLIE                         861
#define CMIE                          862
#define OSCFIE                        863
#define PIR2                          864
#define CCP2IF                        865
#define TMR3IF                        866
#define BCL1IF                        867
#define BCLIF                         868
#define CMIF                          869
#define OSCFIF                        870
#define IPR2                          871
#define CCP2IP                        872
#define TMR3IP                        873
#define BCLIP                         874
#define BCL1IP                        875
#define CMIP                          876
#define OSCFIP                        877
#define PIE3                          878
#define CCP3IE                        879
#define RXB0IE                        880
#define RXBNIE                        881
#define RXB1IE                        882
#define CCP4IE                        883
#define TXB0IE                        884
#define CCP5IE                        885
#define TXB1IE                        886
#define TMR4IE                        887
#define TXB2IE                        888
#define TXBNIE                        889
#define TX2IE                         890
#define RC2IE                         891
#define BCL2IE                        892
#define SSP2IE                        893
#define PIR3                          894
#define CCP3IF                        895
#define RXBNIF                        896
#define CCP4IF                        897
#define CCP5IF                        898
#define TMR4IF                        899
#define TXBNIF                        900
#define TX2IF                         901
#define RC2IF                         902
#define BCL2IF                        903
#define SSP2IF                        904
#define IPR3                          905
#define CCP3IP                        906
#define CCP4IP                        907
#define RXBNIP                        908
#define CCP5IP                        909
#define TMR4IP                        910
#define TX2IP                         911
#define TXBNIP                        912
#define RC2IP                         913
#define BCL2IP                        914
#define SSP2IP                        915
#define EECON1                        916
#define EECON1_WR                     917
#define WREN                          918
#define WRERR                         919
#define FREE                          920
#define RCSTA1                        921
#define RCSTA1_RX9D                   922
#define RX9D1                         923
#define RCSTA1_RCD8                   924
#define RCSTA1_OERR                   925
#define OERR1                         926
#define RCSTA1_FERR                   927
#define FERR1                         928
#define RCSTA1_ADDEN                  929
#define ADDEN1                        930
#define RCSTA1_CREN                   931
#define CREN1                         932
#define SRENA                         933
#define SREN1                         934
#define RCSTA1_SREN                   935
#define RCSTA1_NOT_RC8                936
#define RCSTA1_RC9                    937
#define RCSTA1_nRC8                   938
#define RCSTA1_RC8_9                  939
#define RCSTA1_RX9                    940
#define RX91                          941
#define RCSTA1_SPEN                   942
#define SPEN1                         943
#define TXSTA1                        944
#define TX9D1                         945
#define TXSTA1_TX9D                   946
#define TXSTA1_TXD8                   947
#define TRMT1                         948
#define TXSTA1_TRMT                   949
#define BRGH1                         950
#define TXSTA1_BRGH                   951
#define TXSTA1_SENDB                  952
#define SENDB1                        953
#define TXSTA1_SYNC                   954
#define SYNC1                         955
#define TXEN1                         956
#define TXSTA1_TXEN                   957
#define TX91                          958
#define TXSTA1_NOT_TX8                959
#define TXSTA1_TX8_9                  960
#define TXSTA1_TX9                    961
#define TXSTA1_nTX8                   962
#define TXSTA1_CSRC                   963
#define CSRC1                         964
#define PSPCON                        965
#define PSPMODE                       966
#define IBOV                          967
#define OBF                           968
#define IBF                           969
#define T3CON                         970
#define TMR3ON                        971
#define TMR3CS                        972
#define nT3SYNC                       973
#define NOT_T3SYNC                    974
#define T3SYNC                        975
#define T3INSYNC                      976
#define SOSCEN3                       977
#define T3CCP1                        978
#define T3CKPS                        979
#define T3CKPS0                       980
#define T3CKPS1                       981
#define T3CCP2                        982
#define T3CON_RD16                    983
#define RD163                         984
#define T3RD16                        985
#define CMCON                         986
#define CM                            987
#define CMEN0                         988
#define CM0                           989
#define CMEN1                         990
#define CM1                           991
#define CMEN2                         992
#define CM2                           993
#define CIS                           994
#define C1INV                         995
#define C2INV                         996
#define C1OUT                         997
#define C2OUT                         998
#define CVRCON                        999
#define CVR                           1000
#define CVR0                          1001
#define CVR1                          1002
#define CVR2                          1003
#define CVR3                          1004
#define CVRSS                         1005
#define CVRR                          1006
#define CVROEN                        1007
#define CVROE                         1008
#define CVREN                         1009
#define ECCP1AS                       1010
#define ECCP1AS_PSSBD                 1011
#define ECCP1AS_PSSBD0                1012
#define PSS1BD0                       1013
#define ECCP1AS_PSSBD1                1014
#define PSS1BD1                       1015
#define ECCP1AS_PSSAC0                1016
#define PSS1AC0                       1017
#define ECCP1AS_PSSAC                 1018
#define ECCP1AS_PSSAC1                1019
#define PSS1AC1                       1020
#define ECCP1AS_ECCPAS0               1021
#define ECCP1AS_ECCPAS                1022
#define ECCP1AS0                      1023
#define ECCP1AS_ECCPAS1               1024
#define ECCP1AS1                      1025
#define ECCP1AS_ECCPAS2               1026
#define ECCP1AS2                      1027
#define ECCP1ASE                      1028
#define ECCP1AS_ECCPASE               1029
#define ECCP3CON                      1030
#define CCP3M                         1031
#define CCP3M0                        1032
#define CCP3M1                        1033
#define CCP3M2                        1034
#define CCP3M3                        1035
#define CCP3Y                         1036
#define DC3B                          1037
#define DC3B0                         1038
#define DC3B1                         1039
#define CCP3X                         1040
#define P3M                           1041
#define P3M0                          1042
#define P3M1                          1043
#define ECCP2CON                      1044
#define CCP2M                         1045
#define CCP2M0                        1046
#define CCP2M1                        1047
#define CCP2M2                        1048
#define CCP2M3                        1049
#define DC2B                          1050
#define DC2B0                         1051
#define CCP2Y                         1052
#define DC2B1                         1053
#define CCP2X                         1054
#define P2M                           1055
#define P2M0                          1056
#define P2M1                          1057
#define ECCP1CON                      1058
#define CCP1M0                        1059
#define CCP1M                         1060
#define CCP1M1                        1061
#define CCP1M2                        1062
#define CCP1M3                        1063
#define CCP1Y                         1064
#define DC1B                          1065
#define DC1B0                         1066
#define CCP1X                         1067
#define DC1B1                         1068
#define P1M                           1069
#define P1M0                          1070
#define P1M1                          1071
#define ADCON2                        1072
#define ADCS0                         1073
#define ADCS                          1074
#define ADCS1                         1075
#define ADCS2                         1076
#define ACQT0                         1077
#define ACQT                          1078
#define ACQT1                         1079
#define ACQT2                         1080
#define ADFM                          1081
#define ADCON1                        1082
#define PCFG0                         1083
#define PCFG                          1084
#define PCFG1                         1085
#define PCFG2                         1086
#define CHSN3                         1087
#define PCFG3                         1088
#define VCFG                          1089
#define VCFG0                         1090
